# Java
## 1. java标识符
* 标识符以字母，美元符号和下划线开头
* 首字符之后可以是字母，美元符号，下划线和数字的任意组合
* 大小写敏感
* 关键字不能做标识符
## 2. java注释
单行注释
使用`//`开始

多行注释
以`/*`开始，以`*/`结束

文档注释
以`/**`开始，以`*/`结束
## 3. java对象和类
* 类（Class），定义对象的属性和方法。
* 对象（Object），类的实例。
* 继承，一个类可以继承另一个类的属性和方法。
* 封装，将对象的字段私有化，通过公共方法访问。
* 多态，通过方法重载和方法重写实现。
* 抽象，使用抽象类和接口来定义必须实现的方法，不提供具体实现。
* 接口（Interface），定义类必须实现的方法，支持多重继承。
* 方法，定义类的行为，包含类中的函数。
* 方法重载（overload），同一个类中可以有多个同名的方法，但是参数不同。

类的变量
* 局部变量：在方法，构造方法或者语句块中定义的变量为局部变量。变量声明和初始化都在方法中，方法结束后，变量就会自动销毁。
* 成员变量：成员变量定义在类中，方法体之外的变量。这种变量在创建对象的时候实例化。成员变量可以被类中的方法，构造方法和特定类的语句块访问。
* 类变量：类变量也声明在类中，方法体之外，但必须声明为static类型。类变量与类相关，无论创建多少个类实例，静态变量在内存中只有一份，被所有实例共享。可通过类名或实例名访问。
* 参数变量：用于接收传递给方法或构造函数的值。参数变量的值传递有两种方式：（1）值传递，java基本数据类型都是采用值传递。值传递传递的是参数的值的副本，只会修改副本而不会影响原始值。（2）引用传递，java中的对象类型采用引用传递。传递的是实际参数的引用，会修改原始值的内容。

## 4. java基本数据类型
### 内置数据类型
六种数字类型（四个整数类型，两个浮点型），一种字符类型，一种布尔型。

整数类型
* byte（8位）
* short（16位）
* int（32位），整型默认为int类型。
* long（64位），使用"L"或"l"后缀。
浮点型
* float（单精度，32位）
* double（双精度，64位），浮点型默认为double类型。
字符型
* char
布尔型
* boolean
### 引用数据类型
* 引用类型指向一个对象，指向对象的变量是引用变量。变量被声明后，类型就不能改变了。
* 对象，数组都是引用数据类型。
* 所有引用类型的默认值都是null。
### 常量
使用final关键字来定义常量，常量标识符通常全是大写。
## 5. java修饰符
### 访问控制修饰符
* public，类，变量，接口，方法。
* private，变量，方法。不能修饰类。
* default，类，接口，变量，方法。
* protected，变量，方法。不能修饰类，内部类除外。

| 修饰符     | 当前类 | 同一包内 | 子孙类(同一包) | 子孙类(不同包) | 其他包 |
|------------|--------|----------|----------------|----------------|--------|
| `public`   | Y      | Y        | Y              | Y              | Y      |
| `protected`| Y      | Y        | Y              | Y/N   | N      |
| `default`  | Y      | Y        | Y              | N              | N      |
| `private`  | Y      | N        | N              | N              | N      |

子类与基类不在同一包，在子类中，子类实例可以访问从基类继承而来的protected方法，而不能访问基类实例的protected方法。
### 非访问修饰符
* static，静态变量，静态方法。静态方法不能使用类的非静态变量。
* final，final变量，一旦赋值后，不能被重新赋值。final方法，父类中的final方法可以被子类继承，但不能被重写。final类，不能被继承。
* abstract，抽象类不能用来实例化对象，声明抽象类是为了将来对该类进行扩充。一个类包含抽象方法，一定要声明为抽象类。一个抽象类可以包含抽象方法和非抽象方法。抽象方法是没有任何实现的方法，该方法的具体实现由子类提供。
任何继承抽象类的子类必须实现父类的所有抽象方法。
* synchronized，被该关键字修饰的方法同一时间只能被一个线程访问。
* transient，序列化对象中包含transient修饰的变量，该变量不会被持久化。
* volatile，被该关键字修饰的成员变量在每次被线程访问时，都强制从共享内存中重新读取该成员变量的值。而且，当成员变量发生变化时，以强制线程将变化值回写到共享内存。因此，在任何时刻，两个不同的线程总是看到某个成员变量的同一个值。
### 6. Java运算符

